<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <meta name="renderer" content="webkit">
  <meta http-equiv="X-UA-Compatible" content="IE=edge" >
  <link rel="dns-prefetch" href="http://yoursite.com">
  <title>life &amp;&amp; love</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta property="og:type" content="website">
<meta property="og:title" content="life && love">
<meta property="og:url" content="http://yoursite.com/index.html">
<meta property="og:site_name" content="life && love">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="life && love">
  
    <link rel="alternative" href="/atom.xml" title="life &amp;&amp; love" type="application/atom+xml">
  
  
    <link rel="icon" href="/img/favicon.ico">
  
  <link rel="stylesheet" href="/main.css?v=4.0.0.css">
  

  

</head>

<body>
  <div id="container" q-class="show:isCtnShow">
    <canvas id="anm-canvas" class="anm-canvas"></canvas>
    <div class="left-col" q-class="show:isShow">
      <div class="overlay"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			<img src="/img/portrait.jpg" class="js-avatar">
		</a>

		<hgroup>
		  <h1 class="header-author"><a href="/">路过</a></h1>
		</hgroup>

		
		<p class="header-subtitle">一点点关于生活的感想</p>
		

		<nav class="header-menu">
			<ul>
			
				<li><a href="/">主页</a></li>
	        
				<li><a href="/tags/随笔/">随笔</a></li>
	        
			</ul>
		</nav>
		<nav class="header-smart-menu">
	        
    		
    			
    			<a data-idx="0" q-on="click: openSlider(e, 'innerArchive')" href="javascript:void(0)">所有文章</a>
    			
    			
            
    			
    			<a data-idx="1" q-on="click: openSlider(e, 'friends')" href="javascript:void(0)">友链</a>
    			
    			
            
    			
    			<a data-idx="2" q-on="click: openSlider(e, 'aboutme')" href="javascript:void(0)">关于我</a>
    			
    			
            
		</nav>
		<nav class="header-nav">
			<div class="social">
				
					<a class="github" target="_blank" href="#" title="github"><i class="icon-github"></i></a>
		        
					<a class="weibo" target="_blank" href="#" title="weibo"><i class="icon-weibo"></i></a>
		        
					<a class="rss" target="_blank" href="#" title="rss"><i class="icon-rss"></i></a>
		        
					<a class="zhihu" target="_blank" href="#" title="zhihu"><i class="icon-zhihu"></i></a>
		        
			</div>
		</nav>
	</header>		
</div>

    </div>
    <div class="mid-col" q-class="show:isShow,hide:isShow|isFalse">
      <nav id="mobile-nav">
  	<div class="overlay">
  		<div class="slider-trigger"><i class="icon-sort"></i></div>
  		<h1 class="header-author js-mobile-header hide">路过</h1>
  	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
				<img src="/img/portrait.jpg" class="js-avatar">
			</div>
			<hgroup>
			  <h1 class="header-author">路过</h1>
			</hgroup>
			
			<p class="header-subtitle">一点点关于生活的感想</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/tags/随笔/">随笔</a></li>
		        
		        
		        	<li><a href="/archives/">所有文章</a></li>
		        
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="#" title="github"><i class="icon-github"></i></a>
			        
						<a class="weibo" target="_blank" href="#" title="weibo"><i class="icon-weibo"></i></a>
			        
						<a class="rss" target="_blank" href="#" title="rss"><i class="icon-rss"></i></a>
			        
						<a class="zhihu" target="_blank" href="#" title="zhihu"><i class="icon-zhihu"></i></a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>

      <div id="wrapper" class="body-wrap">
        <div class="menu-l">
          <div class="canvas-wrap">
            <canvas data-colors="#eaeaea" data-sectionHeight="100" data-contentId="js-content" id="myCanvas1" class="anm-canvas"></canvas>
          </div>
          <div id="js-content" class="content-ll">
            
  
    <article id="post-christmas" class="article article-type-post  article-index" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/12/25/christmas/">christmas</a>
    </h1>
  

        <a href="/2016/12/25/christmas/" class="archive-article-date">
  	<time datetime="2016-12-25T16:14:52.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-12-25</time>
</a>
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <h2 id="&#x5723;&#x8BDE;&#x5FEB;&#x4E50;"><a href="#&#x5723;&#x8BDE;&#x5FEB;&#x4E50;" class="headerlink" title="&#x5723;&#x8BDE;&#x5FEB;&#x4E50;"></a>&#x5723;&#x8BDE;&#x5FEB;&#x4E50;</h2><p>&#x5723;&#x8BDE;&#x8282;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x5730;&#x5C31;&#x5230;&#x4E86;&#xFF0C;&#x539F;&#x4EE5;&#x4E3A;&#x5723;&#x8BDE;&#x8282;&#x53EA;&#x80FD;&#x7A9D;&#x5728;&#x5BB6;&#x91CC;&#x3002;&#x60F3;&#x4E0D;&#x5230;&#x4ECA;&#x5E74;&#x7684;&#x5E73;&#x5B89;&#x591C;&#x548C;&#x540C;&#x5B66;&#x4E00;&#x8D77;&#x53BB;&#x770B;downtown &#x7684;&#x5723;&#x8BDE;&#x6811;&#xFF0C;&#x56DE;&#x6765;&#x7684;&#x8DEF;&#x4E0A;&#x5728;&#x5339;&#x5927;&#x53C8;&#x53D1;&#x751F;&#x4E86;&#x4E00;&#x4E9B;&#x5F88;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4ECA;&#x5929;&#x8FD8;&#x8981;&#x53BB;&#x540C;&#x5B66;&#x5BB6;&#x91CC;&#x4E00;&#x8D77;&#x805A;&#x9910;&#xFF0C;&#x611F;&#x89C9;&#x8FD9;&#x4E2A;&#x5723;&#x8BDE;&#x8282;&#x4E0D;&#x50CF;&#x4EE5;&#x524D;&#x90A3;&#x4E48;&#x51B7;&#x4E86;&#x3002;&#x800C;&#x4E14;&#x6700;&#x8FD1;&#x611F;&#x89C9;&#x597D;&#x50CF;&#x8FD0;&#x52BF;&#x90FD;&#x4E0D;&#x9519;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x7EE7;&#x7EED;&#x4E0B;&#x53BB;&#x3002;</p>

      

      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags"></i>
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/生活/">生活</a></li></ul>
	</div>

      

      
        <p class="article-more-link">
          <a class="article-more-a" href="/2016/12/25/christmas/">展开全文 >></a>
        </p>
      

      
      <div class="clearfix"></div>
    </div>
  </div>
</article>








  
    <article id="post-howto" class="article article-type-post  article-index" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/12/19/howto/">碎碎念</a>
    </h1>
  

        <a href="/2016/12/19/howto/" class="archive-article-date">
  	<time datetime="2016-12-20T02:58:07.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-12-19</time>
</a>
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <h2 id="&#x600E;&#x4E48;&#x5531;&#x60C5;&#x6B4C;"><a href="#&#x600E;&#x4E48;&#x5531;&#x60C5;&#x6B4C;" class="headerlink" title="&#x600E;&#x4E48;&#x5531;&#x60C5;&#x6B4C;"></a>&#x600E;&#x4E48;&#x5531;&#x60C5;&#x6B4C;</h2><p>&#x5BD2;&#x5047;&#x95F7;&#x5728;&#x5BB6;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5916;&#x9762;&#x5929;&#x6C14;&#x4E0D;&#x597D;&#x662F;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x3002;&#x518D;&#x4E00;&#x4E2A;&#xFF0C;&#x5C31;&#x662F;&#x4E0D;&#x60F3;&#x53BB;&#x5B66;&#x6821;&#xFF0C;&#x611F;&#x89C9;&#x5F88;&#x7D2F;&#x3002;&#x6709;&#x70B9;&#x513F;&#x50CF;&#x53BB;&#x5E74;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x653E;&#x5047;&#x5728;&#x5BB6;&#xFF0C;&#x6162;&#x60A0;&#x60A0;&#x5730;&#x5237;sedgewick&#x7684;&#x7EA2;&#x8272;&#x7B97;&#x6CD5;&#x4E66;&#x3002;&#x53EF;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x5BB6;&#xFF0C;&#x603B;&#x611F;&#x89C9;&#x65E0;&#x804A;&#xFF0C;&#x4F46;&#x662F;&#x51FA;&#x95E8;&#x53C8;&#x4E0D;&#x77E5;&#x9053;&#x80FD;&#x53BB;&#x90A3;&#x3002;&#x53BB;&#x5E74;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x8FD8;&#x6709;&#x59B9;&#x5B50;&#x80FD;&#x5728;&#x7F51;&#x4E0A;&#x804A;&#x804A;&#x5929;&#xFF0C;&#x4ECA;&#x5E74;&#x5C31;&#x53EA;&#x80FD;&#x3002;&#x3002;&#x3002;&#x4E0D;&#x8FC7;&#x4E5F;&#x597D;&#xFF0C;&#x591A;&#x5199;&#x5199;&#x9898;&#x3002;&#x603B;&#x611F;&#x89C9;&#x4E0D;&#x8981;&#x7ED9;&#x81EA;&#x5DF1;&#x538B;&#x529B;&#x592A;&#x5927;&#xFF0C;&#x672C;&#x79D1;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x662F;&#x603B;&#x662F;&#x592A;push&#x81EA;&#x5DF1;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x603B;&#x662F;&#x4E0D;&#x5FEB;&#x4E50;&#xFF0C;&#x5176;&#x5B9E;&#x7A0D;&#x5FAE;&#x653E;&#x677E;&#x4E00;&#x4E9B;&#xFF0C;&#x7ED3;&#x679C;&#x4E5F;&#x5DEE;&#x4E0D;&#x4E86;&#x591A;&#x5C11;&#x3002;&#x538B;&#x529B;&#x592A;&#x5927;&#xFF0C;&#x53CD;&#x800C;&#x5F71;&#x54CD;&#x4E86;&#x8EAB;&#x5FC3;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5F88;&#x60F3;&#x6709;&#x4E00;&#x90E8;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x8F66;&#xFF0C;&#x5C31;&#x7B97;&#x662F;&#x6F2B;&#x65E0;&#x76EE;&#x7684;&#x5730;&#x8D70;&#xFF0C;&#x4E5F;&#x80FD;&#x53BB;&#x8FDC;&#x4E00;&#x4E9B;&#x7684;&#x5730;&#x65B9;&#x6563;&#x6563;&#x5FC3;&#x3002;</p>
<p>&#x5DF2;&#x7ECF;&#x4E0D;&#x50CF;&#x4EE5;&#x524D;&#x90A3;&#x6837;&#x4E86;&#xFF0C;&#x5BF9;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x4E8B;&#x60C5;&#x6000;&#x6709;&#x592A;&#x5F3A;&#x70C8;&#x7684;&#x671F;&#x671B;&#x3002;&#x7ECF;&#x5386;&#x4E86;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x4E4B;&#x540E;&#xFF0C;&#x89C9;&#x5F97;&#x5E73;&#x5B89;&#x662F;&#x798F;&#xFF0C;&#x53EA;&#x8981;&#x8EAB;&#x5FC3;&#x5065;&#x5EB7;&#x5C31;&#x597D;&#x3002;&#x5B66;&#x4E60;&#x5DE5;&#x4F5C;&#x7231;&#x60C5;&#xFF0C;&#x53EA;&#x80FD;&#x8BF4;&#x81EA;&#x5DF1;&#x5C3D;&#x529B;&#x53BB;&#x6295;&#x5165;&#xFF0C;&#x65E0;&#x8BBA;&#x7ED3;&#x679C;&#x5982;&#x4F55;&#xFF0C;&#x90FD;&#x8981;&#x5766;&#x7136;&#x53BB;&#x63A5;&#x53D7;&#xFF0C;&#x56E0;&#x4E3A;&#x52AA;&#x529B;&#x8FC7;&#x4E86;&#xFF0C;&#x5C31;&#x4E0D;&#x5E94;&#x8BE5;&#x540E;&#x6094;&#xFF0C;&#x81F3;&#x4E8E;&#x7ED3;&#x5C40;&#x5982;&#x4F55;&#x5DF2;&#x7ECF;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x80FD;&#x638C;&#x63A7;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x601D;&#x8003;&#x5FE7;&#x8651;&#x592A;&#x591A;&#xFF0C;&#x5927;&#x6982;&#x4E5F;&#x53EA;&#x662F;&#x5EB8;&#x4EBA;&#x81EA;&#x6270;&#x3002;&#x300A;&#x600E;&#x4E48;&#x5531;&#x60C5;&#x6B4C;&#x300B;&#xFF0C;&#x6211;&#x5927;&#x6982;&#x662F;&#x4ECE;&#x524D;&#x5973;&#x53CB;&#x90A3;&#x7B2C;&#x4E00;&#x6B21;&#x542C;&#x8FC7;&#x8FD9;&#x9996;&#x6B4C;&#x3002;&#x90A3;&#x65F6;&#xFF0C;&#x6211;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5F88;&#x6E05;&#x695A;&#x7684;&#x5370;&#x8C61;&#xFF0C;&#x53EA;&#x662F;&#x8BB0;&#x5F97;&#x5979;&#x559C;&#x6B22;&#x4E00;&#x4E9B;&#x7565;&#x5E26;&#x611F;&#x4F24;&#x7684;&#x5C0F;&#x6E05;&#x65B0;&#x6B4C;&#x66F2;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#xFF0C;&#x548C;&#x5979;&#x4E00;&#x8D77;&#x5728;&#x516C;&#x56ED;&#x91CC;&#x6F2B;&#x6B65;&#xFF0C;&#x8D70;&#x7D2F;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5750;&#x5728;&#x516C;&#x56ED;&#x7684;&#x957F;&#x51F3;&#x4E0A;&#x3002;&#x5979;&#x62FF;&#x51FA;&#x8033;&#x673A;&#xFF0C;&#x6211;&#x4EEC;&#x9760;&#x5728;&#x4E00;&#x8D77;&#x542C;&#x6B4C;&#x3002;&#x201C;&#x7231; &#x5269;&#x4E0B;&#x5FC3;&#x9178; &#x70ED;&#x60C5;&#x603B;&#x4F1A;&#x53D8;&#x51B7;&#x6DE1;&#x201D;&#xFF0C;&#x7814;&#x4E00;&#x7684;&#x4E0B;&#x534A;&#x5B66;&#x671F;&#xFF0C;&#x5FC3;&#x60C5;&#x82E6;&#x6DA9;&#x538B;&#x6291;&#xFF0C;&#x4EBA;&#x5728;&#x8106;&#x5F31;&#x7684;&#x65F6;&#x5019;&#x60C5;&#x611F;&#x5374;&#x6108;&#x53D1;&#x5730;&#x4E30;&#x5BCC;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x7ADF;&#x7136;&#x4E00;&#x904D;&#x904D;&#x5730;&#x542C;&#x7740;&#x90A3;&#x4E9B;&#x4E4B;&#x524D;&#x4ECE;&#x6765;&#x4E0D;&#x611F;&#x5192;&#x7684;&#x6B4C;&#xFF0C;&#x804A;&#x4EE5;&#x6170;&#x85C9;&#x3002;</p>
<p><img src="/2016/12/19/howto/p1.jpg" alt=""></p>
<p>&#x5728;&#x5339;&#x6751;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x81EA;&#x5DF1;&#x662F;&#x6211;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x5979;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x575A;&#x6301;&#x4E0B;&#x6765;&#x3002;&#x5728;&#x8FD9;&#x8FB9;&#xFF0C;&#x4E5F;&#x6709;&#x9047;&#x5230;&#x8FC7;&#x8BA9;&#x81EA;&#x5DF1;&#x6709;&#x51E0;&#x5206;&#x559C;&#x6B22;&#x7684;&#x5973;&#x751F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5206;&#x624B;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x5BF9;&#x6211;&#x4E5F;&#x8BB8;&#x4F24;&#x5BB3;&#x66F4;&#x5927;&#x4E00;&#x4E9B;&#x5427;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x5426;&#x662F;&#x81EA;&#x5DF1;&#x4E00;&#x76F4;&#x5728;&#x52C9;&#x5F3A;&#x5979;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x51B3;&#x5B9A;&#x548C;&#x5979;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5C31;&#x5DF2;&#x7ECF;&#x6295;&#x5165;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x611F;&#x60C5;&#x3002;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x5F88;&#x6253;&#x51FB;&#x4EBA;&#x4FE1;&#x5FC3;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x5373;&#x4F7F;&#x6709;&#x559C;&#x6B22;&#x7684;&#x5973;&#x751F;&#xFF0C;&#x4E5F;&#x6697;&#x81EA;&#x62C5;&#x5FC3;&#x662F;&#x4E0D;&#x662F;&#x5728;&#x81EA;&#x4F5C;&#x591A;&#x60C5;&#x3002;&#x4E00;&#x76F4;&#x60F3;&#x53BB;&#x534E;&#x76DB;&#x987F;&#x5C71;&#x770B;&#x591C;&#x666F;&#xFF0C;&#x542C;&#x8BF4;&#x5728;&#x5C71;&#x9876;&#x4E0A;&#x80FD;&#x4FEF;&#x77B0;&#x6574;&#x4E2A;&#x5339;&#x5179;&#x5821;&#x7684;&#x706F;&#x706B;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x76F4;&#x6CA1;&#x53BB;&#xFF0C;&#x4E00;&#x662F;&#x6CA1;&#x8F66;&#xFF0C;&#x4E8C;&#x662F;&#x89C9;&#x5F97;&#x8FD9;&#x79CD;&#x573A;&#x5408;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x4E00;&#x4E2A;&#x4EBA;&#x53BB;&#x3002;&#x4E4B;&#x524D;&#x4E5F;&#x6709;&#x5728;&#x8003;&#x8651;&#xFF0C;&#x4E5F;&#x8BB8;&#x4EE5;&#x540E;&#x8FD8;&#x6709;&#x673A;&#x4F1A;&#x590D;&#x5408;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x90A3;&#x6B21;&#x53D1;&#x73B0;&#x5979;&#x5F88;&#x5FEB;&#x5C31;&#x53E6;&#x5BFB;&#x65B0;&#x6B22;&#xFF0C;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x5979;&#x786E;&#x5B9E;&#x662F;&#x4E0D;&#x559C;&#x6B22;&#x6211;&#x3002;&#x7F62;&#x4E86;&#xFF0C;&#x4EBA;&#x5404;&#x6709;&#x4EBA;&#x7684;&#x547D;&#x548C;&#x8FD0;&#xFF0C;&#x4E5F;&#x8BB8;&#x6211;&#x4EEC;&#x547D;&#x91CC;&#x6CE8;&#x5B9A;&#x5C31;&#x4F1A;&#x50CF;&#x4E24;&#x6761;&#x5E73;&#x884C;&#x7EBF;&#x3002;&#x201C;&#x5148;&#x52D5;&#x5FC3;&#x7684;&#x5148;&#x50B7;&#x5FC3; &#x5148;&#x8A8D;&#x771F;&#x5148;&#x8A8D;&#x547D;&#x201D;&#xFF0C;831&#x7684;&#x300A;&#x6771;&#x5340;&#x6771;&#x5340;&#x300B;&#x4E5F;&#x8BB8;&#x8BF4;&#x7684;&#x4E00;&#x70B9;&#x6CA1;&#x9519;&#x5427;&#xFF0C;&#x5148;&#x52A8;&#x5FC3;&#x5148;&#x4F24;&#x5FC3;&#xFF0C;&#x6CA1;&#x52A8;&#x5FC3;&#x7684;&#x4E0D;&#x4F24;&#x5FC3;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#xFF0C;&#x770B;&#x6DE1;&#x4E00;&#x4E9B;&#x3002;&#x4EBA;&#x751F;&#x5F88;&#x957F;&#xFF0C;&#x5931;&#x53BB;&#x4E86;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x7B97;&#x4E86;&#x5427;&#x3002;</p>

      

      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags"></i>
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/音乐/">音乐</a></li></ul>
	</div>

      

      
        <p class="article-more-link">
          <a class="article-more-a" href="/2016/12/19/howto/">展开全文 >></a>
        </p>
      

      
      <div class="clearfix"></div>
    </div>
  </div>
</article>








  
    <article id="post-life" class="article article-type-post  article-index" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <header class="article-header">
        
  
    <h1 itemprop="name">
      <a class="article-title" href="/2016/12/16/life/">生活</a>
    </h1>
  

        <a href="/2016/12/16/life/" class="archive-article-date">
  	<time datetime="2016-12-17T02:04:55.000Z" itemprop="datePublished"><i class="icon-calendar icon"></i>2016-12-16</time>
</a>
      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <h2 id="&#x4ECE;&#x4F60;&#x7684;&#x5168;&#x4E16;&#x754C;&#xFF0C;&#x8DEF;&#x8FC7;&#x9752;&#x6625;"><a href="#&#x4ECE;&#x4F60;&#x7684;&#x5168;&#x4E16;&#x754C;&#xFF0C;&#x8DEF;&#x8FC7;&#x9752;&#x6625;" class="headerlink" title="&#x4ECE;&#x4F60;&#x7684;&#x5168;&#x4E16;&#x754C;&#xFF0C;&#x8DEF;&#x8FC7;&#x9752;&#x6625;"></a>&#x4ECE;&#x4F60;&#x7684;&#x5168;&#x4E16;&#x754C;&#xFF0C;&#x8DEF;&#x8FC7;&#x9752;&#x6625;</h2><p>&#x671F;&#x672B;&#x7ED3;&#x675F;&#xFF0C;&#x5305;&#x88B1;&#x4E5F;&#x53EF;&#x4EE5;&#x6682;&#x65F6;&#x653E;&#x4E0B;&#x3002;&#x665A;&#x4E0A;&#x56DE;&#x5230;&#x5BB6;&#xFF0C;&#x6253;&#x5F00;youtube&#xFF0C;&#x83AB;&#x540D;&#x5730;&#x8F93;&#x5165;&#x4E86;&#x8FD9;&#x90E8;&#x7535;&#x5F71;&#x3002;&#x5341;&#x6708;&#x521D;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x5B83;&#x4E0A;&#x6620;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#xFF0C;&#x6070;&#x5DE7;&#x4E5F;&#x662F;&#x6211;&#x4E3A;&#x4E00;&#x6BB5;&#x611F;&#x60C5;&#x82E6;&#x82E6;&#x6323;&#x624E;&#x7684;&#x65E5;&#x5B50;&#x3002;&#x5982;&#x4ECA;&#xFF0C;&#x90A3;&#x6BB5;&#x611F;&#x60C5;&#x5DF2;&#x7ECF;&#x70DF;&#x6D88;&#x4E91;&#x6563;&#xFF0C;&#x6211;&#x5374;&#x53EA;&#x80FD;&#x7EE7;&#x7EED;&#x8D70;&#x7740;&#xFF0C;&#x4E5F;&#x8BB8;&#xFF0C;&#x8FD9;&#x6B63;&#x662F;&#x751F;&#x6D3B;&#x7684;&#x6B8B;&#x9177;&#x4E4B;&#x5904;&#x3002;</p>
<p>&#x9648;&#x672B;&#x3001;&#x8305;&#x5341;&#x516B;&#x548C;&#x732A;&#x5934;&#xFF0C;&#x4ED6;&#x4EEC;&#x4EE3;&#x8868;&#x6BCF;&#x4E2A;&#x4EBA;&#x6216;&#x591A;&#x6216;&#x5C11;&#x90FD;&#x4F1A;&#x6709;&#x7684;&#x7ECF;&#x5386;&#x3002;&#x5931;&#x604B;&#x7684;&#x6D88;&#x6C89;&#x3001;&#x70ED;&#x70C8;&#x7684;&#x751C;&#x871C;&#x3001;&#x4E00;&#x5473;&#x5730;&#x4ED8;&#x51FA;&#x8FD8;&#x6709;&#x6697;&#x604B;&#x7684;&#x82E6;&#x6DA9;&#x3002;&#x6211;&#x559C;&#x6B22;&#x8354;&#x679D;&#xFF0C;&#x56E0;&#x4E3A;&#x5979;&#x7684;&#x6D3B;&#x6CFC;&#x53EF;&#x7231;&#x5E26;&#x7ED9;&#x4E86;&#x5446;&#x677F;&#x7684;&#x8305;&#x5341;&#x516B;&#x5185;&#x5FC3;&#x7684;&#x5FEB;&#x4E50;&#xFF0C;&#x591A;&#x5C11;&#x6709;&#x4E9B;&#x5171;&#x9E23;&#x5427;&#x3002;&#x5728;&#x90A3;&#x6240;&#x5DE5;&#x79D1;&#x5927;&#x5B66;&#x7684;&#x51E0;&#x5E74;&#xFF0C;&#x51E0;&#x6B21;&#x632B;&#x6298;&#xFF0C;&#x5185;&#x5FC3;&#x6E34;&#x671B;&#x5374;&#x53C8;&#x6015;&#x6536;&#x5230;&#x4F24;&#x5BB3;&#x3002;&#x508D;&#x665A;&#x65F6;&#x5206;&#xFF0C;&#x897F;&#x5C71;&#x6D8C;&#x52A8;&#x7684;&#x4EBA;&#x6D77;&#x6469;&#x80A9;&#x64E6;&#x8E35;&#xFF0C;&#x5185;&#x5FC3;&#x5374;&#x4F9D;&#x7136;&#x5B64;&#x72EC;&#x3002;&#x5C31;&#x50CF;&#x7535;&#x5F71;&#x91CC;&#x9648;&#x672B;&#x7AD9;&#x5728;&#x5929;&#x53F0;&#x4E0A;&#x671B;&#x7740;&#x7E41;&#x534E;&#x7684;&#x57CE;&#x5E02;&#x4E07;&#x5BB6;&#x706F;&#x706B;&#xFF0C;&#x5374;&#x6709;&#x4E00;&#x79CD;&#x83AB;&#x540D;&#x7684;&#x5B64;&#x72EC;&#x611F;&#x4EE4;&#x4EBA;&#x7A92;&#x606F;&#x3002;&#x8C28;&#x5C0F;&#x614E;&#x5FAE;&#xFF0C;&#x8E3D;&#x8E3D;&#x72EC;&#x884C;&#x3002;</p>
<p><img src="/2016/12/16/life/p1.jpg" alt=""></p>
<p>&#x8FD9;&#x4E00;&#x5E74;&#x534A;&#x6765;&#xFF0C;&#x4ECE;&#x5317;&#x65B9;&#x7684;&#x6EE8;&#x57CE;&#x5230;&#x5357;&#x56FD;&#x7684;&#x7F8A;&#x57CE;&#xFF0C;&#x6211;&#x7ECF;&#x5386;&#x4E86;&#x5F88;&#x591A;&#x4EBA;&#x4E0E;&#x4E8B;&#x3002;&#x5728;&#x7236;&#x6BCD;&#x7684;&#x76EE;&#x9001;&#x4E0B;&#x79BB;&#x5F00;&#x6545;&#x4E61;&#xFF0C;&#x6765;&#x5230;&#x4E07;&#x91CC;&#x4E4B;&#x5916;&#x7684;&#x7F8E;&#x56FD;&#xFF0C;&#x66F4;&#x52A0;&#x61C2;&#x5F97;&#x4E86;&#x4EB2;&#x60C5;&#x7684;&#x73CD;&#x8D35;&#x3002;&#x9762;&#x5BF9;&#x5B66;&#x4E60;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x4E5F;&#x6162;&#x6162;&#x5B66;&#x4F1A;&#x53BB;&#x8C03;&#x6574;&#x597D;&#x81EA;&#x5DF1;&#x3002;&#x53EA;&#x662F;&#x611F;&#x89C9;&#x65F6;&#x95F4;&#x8FC7;&#x5F97;&#x592A;&#x5FEB;&#xFF0C;&#x9664;&#x4E86;&#x611F;&#x6168;&#xFF0C;&#x4F59;&#x4E0B;&#x7684;&#x53EA;&#x6709;&#x6728;&#x7136;&#x3002;&#x65E5;&#x5B50;&#x8FC7;&#x5F97;&#x4E0D;&#x597D;&#x4E0D;&#x574F;&#xFF0C;&#x53EA;&#x662F;&#xFF0C;&#x5728;&#x60F3;&#x8D77;&#x90A3;&#x6BB5;&#x611F;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5185;&#x5FC3;&#x8FD8;&#x662F;&#x6709;&#x51E0;&#x5206;&#x60B2;&#x4F24;&#xFF0C;&#x4E5F;&#x4F1A;&#x6709;&#x70B9;&#x6D88;&#x6C89;&#x3002;&#x9648;&#x672B;&#x5185;&#x5FC3;&#x7684;&#x75DB;&#x82E6;&#xFF0C;&#x591A;&#x5C11;&#x4E5F;&#x662F;&#x80FD;&#x591F;&#x4F53;&#x4F1A;&#xFF0C;&#x5206;&#x624B;&#x540E;&#x8FD8;&#x60F3;&#x5E2E;&#x524D;&#x5973;&#x53CB;&#x5EA6;&#x8FC7;&#x96BE;&#x5173;&#xFF0C;&#x591A;&#x5C11;&#x4E5F;&#x662F;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x3002;&#x662F;&#x554A;&#xFF0C;&#x4EBA;&#x7684;&#x611F;&#x60C5;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x5FAE;&#x5999;&#xFF0C;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x3002; </p>
<p>&#x9648;&#x672B;&#x7B49;&#x6765;&#x4E86;&#x5E7A;&#x9E21;&#xFF0C;&#x4E00;&#x4E2A;&#x7231;&#x81EA;&#x5DF1;&#x7684;&#x5973;&#x4EBA;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x597D;&#x7684;&#x7ED3;&#x5C40;&#x3002;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x547D;&#x8FD0;&#xFF0C;&#x5931;&#x53BB;&#x7684;&#x4E1C;&#x897F;&#x6C38;&#x8FDC;&#x5730;&#x5931;&#x53BB;&#x4E86;&#xFF0C;&#x65E0;&#x6CD5;&#x633D;&#x7559;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#xFF0C;&#x4E5F;&#x8BB8;&#x4E0D;&#x662F;&#x6297;&#x4E89;&#xFF0C;&#x53BB;&#x6298;&#x78E8;&#x81EA;&#x5DF1;&#x610F;&#x5FD7;&#x6D88;&#x6C89;&#x3002;&#x4E5F;&#x8BB8;&#xFF0C;&#x52C7;&#x6562;&#x4E00;&#x4E9B;&#x5730;&#x5411;&#x524D;&#x8D70;&#xFF0C;&#x5E73;&#x9759;&#x5730;&#x63A5;&#x53D7;&#x662F;&#x6700;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;&#x4ECE;&#x5979;&#x5BF9;&#x6211;&#x53D8;&#x5F97;&#x9010;&#x6E10;&#x51B7;&#x6DE1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x9884;&#x6599;&#x5230;&#x4E86;&#x7ED3;&#x5C40;&#x3002;&#x53EA;&#x4E0D;&#x8FC7;&#xFF0C;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x7ED3;&#x675F;&#x4F1A;&#x6765;&#x7684;&#x8FD9;&#x4E48;&#x5730;&#x5FEB;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x5BF9;&#x65B9;&#x7684;&#x6001;&#x5EA6;&#x4F1A;&#x8FD9;&#x6837;&#x7684;&#x575A;&#x51B3;&#x3002;&#x7231;&#x6CA1;&#x7231;&#x8FC7;&#x5DF2;&#x7ECF;&#x4E0D;&#x91CD;&#x8981;&#x4E86;&#xFF0C;&#x4E5F;&#x8BB8;&#x6211;&#x8FD8;&#x8981;&#x66F4;&#x6210;&#x719F;&#x4E00;&#x4E9B;&#xFF0C;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x54EA;&#x91CC;&#x4E0D;&#x5BF9;&#x66F4;&#x91CD;&#x8981;&#x4E00;&#x4E9B;&#x5427;&#x3002;&#x7535;&#x5F71;&#x7EC8;&#x5F52;&#x662F;&#x7535;&#x5F71;&#xFF0C;&#x620F;&#x5267;&#x6027;&#x7684;&#x4E1C;&#x897F;&#x591A;&#x4E86;&#x4E00;&#x4E9B;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4F9D;&#x7136;&#x8981;&#x9009;&#x62E9;&#x53BB;&#x76F8;&#x4FE1;&#xFF0C;&#x53BB;&#x9762;&#x5BF9;&#x547D;&#x8FD0;&#x3002;</p>
<p>&#x5931;&#x604B;&#x7684;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x7ECF;&#x5E38;&#x542C;&#x674E;&#x8363;&#x6D69;&#x7684;&#x6B4C;&#x3002;&#x5531;&#x7684;&#x8FD8;&#x662F;&#x9752;&#x6625;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x5374;&#x53C8;&#x6709;&#x4E86;&#x51E0;&#x5206;&#x6CA7;&#x6851;&#x611F;&#x3002;&#x5C31;&#x50CF;&#x9093;&#x8D85;&#xFF0C;&#x6F14;&#x7684;&#x8FD8;&#x662F;&#x7537;&#x7537;&#x5973;&#x5973;&#x7684;&#x66F2;&#x6298;&#xFF0C;&#x5934;&#x4E0A;&#x7684;&#x767D;&#x53D1;&#x5374;&#x8BA9;&#x4EBA;&#x51E0;&#x5206;&#x550F;&#x5618;&#x3002;&#x559C;&#x5267;&#x4E4B;&#x738B;&#x7684;MV&#xFF0C;&#x4E00;&#x5C42;&#x5C42;&#x7684;&#x68A6;&#x5883;&#x5760;&#x843D;&#xFF0C;&#x6070;&#x4F3C;&#x6211;&#x5728;&#x68A6;&#x4E2D;&#x68A6;&#x5230;&#x3002;&#x5973;&#x5B69;&#x7684;&#x4F24;&#x611F;&#x548C;&#x5473;&#x9053;&#xFF0C;&#x4E00;&#x4E2A;&#x6691;&#x5047;&#x6162;&#x6162;&#x5730;&#x6D88;&#x5931;&#x4E86;&#xFF0C;&#x201C;&#x9752;&#x6625;&#x671F;&#x7684;&#x73A9;&#x4F34; &#x5929;&#x7A7A;&#x662F;&#x90A3;&#x79CD;&#x84DD; &#x8981;&#x6210;&#x719F;&#x5F88;&#x7B80;&#x5355; &#x4E5F;&#x53EA;&#x4E0D;&#x8FC7;&#x5C31;&#x662F; &#x4E60;&#x60EF;&#x628A;&#x957F;&#x5934;&#x53D1;&#x526A;&#x77ED;&#x201D;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x6B4C;&#x4E2D;&#x5531;&#x7684;&#xFF0C;&#x4EE4;&#x4EBA;&#x6F78;&#x7136;&#x3002;&#x6211;&#x4EEC;&#x4ECE;&#x5C0F;&#x76F8;&#x8BC6;&#xFF0C;&#x662F;&#x5F7C;&#x6B64;&#x7684;&#x73A9;&#x4F34;&#xFF0C;&#x6C89;&#x9189;&#x4E8E;&#x5979;&#x957F;&#x53D1;&#x98D8;&#x98D8;&#x7684;&#x6E29;&#x67D4;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x4E00;&#x5929;&#x3002;&#x3002;&#x3002;</p>
<blockquote>
<p>&#x4EBA;&#x8BF4;&#x5FC3;&#x5982;&#x5200;&#x5272;    </p>
<p>&#x94BB;&#x77F3;&#x8981;&#x7422;&#x78E8;</p>
<p>&#x611F;&#x8C22;&#x90A3;&#x4E9B;&#x4EBA;&#x64E6;&#x8FC7;&#x522E;&#x8FC7;</p>
<p>&#x751F;&#x6D3B;&#x624D;&#x6709;&#x66F4;&#x7F8E;&#x8F6E;&#x5ED3;    </p>
<p>&#x5E72;&#x4E86;&#x6BCF;&#x6EF4;&#x5BC2;&#x5BDE;    </p>
<p>&#x8FDB;&#x5316;&#x6210;&#x66F4;&#x597D;&#x7684;&#x6211;</p>
<p>&#x7B49;&#x7740;&#x4F60;&#x5728;&#x6211;&#x4E16;&#x754C;&#x8DEF;&#x8FC7;</p>
<blockquote>
<p><cite>&#x674E;&#x8363;&#x6D69;&#x300A;&#x4E0D;&#x8BF4;&#x300B;<strong>&#x7535;&#x5F71;&#x300A;&#x4ECE;&#x4F60;&#x7684;&#x5168;&#x4E16;&#x754C;&#x8DEF;&#x8FC7;&#x300B;&#x8DEF;&#x8FC7;&#x7248;&#x4E3B;&#x9898;&#x66F2;</strong></cite>    </p>
</blockquote>
</blockquote>

      

      
    </div>
    <div class="article-info article-info-index">
      
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags"></i>
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/电影/">电影</a></li></ul>
	</div>

      

      
        <p class="article-more-link">
          <a class="article-more-a" href="/2016/12/16/life/">展开全文 >></a>
        </p>
      

      
      <div class="clearfix"></div>
    </div>
  </div>
</article>








  
  


          </div>
        </div>
      </div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2017 路过
    	</div>
      	<div class="footer-right">
      		本站总访问量 <span id="busuanzi_value_site_pv"></span> 次, 
		访客数 <span id="busuanzi_value_site_uv"></span> 人次
      	</div>
    </div>
  </div>
</footer>
<script async src="//dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js"></script>

    </div>
    <script>
	var yiliaConfig = {
		mathjax: false,
		isHome: true,
		isPost: false,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false,
		root: "/",
		innerArchive: true
	}
</script>

<script src="/./main.js?v=4.0.0.js"></script>


    
<div class="tools-col" q-class="show:isShow,hide:isShow|isFalse" q-on="click:stop(e)">
  <div class="tools-wrap">
    
    	<section class="tools-section tools-section-all" q-show="innerArchive">
        <div class="search-wrap">
          <input class="search-ipt" q-model="search" type="text" placeholder="find something…">
          <i class="icon-search icon" q-show="search|isEmptyStr"></i>
          <i class="icon-close icon" q-show="search|isNotEmptyStr" q-on="click:clearChose(e)"></i>
        </div>
        <div class="widget tagcloud search-tag">
          <p class="search-tag-wording">tag:</p>
          <label class="search-switch">
            <input type="checkbox" q-on="click:toggleTag(e)" q-attr="checked:showTags">
          </label>
          <ul class="article-tag-list" q-show="showTags">
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)">生活</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)">音乐</a>
              </li>
             
              <li class="article-tag-list-item">
                <a href="javascript:void(0)">电影</a>
              </li>
            
            <div class="clearfix"></div>
          </ul>
        </div>
        <ul class="search-ul">
          <p q-show="jsonFail" style="padding: 20px; font-size: 12px;">
            缺失模块。<br/>1、在博客根目录（注意不是yilia根目录）执行以下命令：<br/> npm i hexo-generator-json-content --save<br/><br/>
            2、在根目录_config.yml里添加配置：
<pre style="font-size: 12px;" q-show="jsonFail">
  jsonContent:
    meta: false
    pages: false
    posts:
      title: true
      date: true
      path: true
      text: true
      raw: false
      content: false
      slug: false
      updated: false
      comments: false
      link: false
      permalink: false
      excerpt: false
      categories: false
      tags: true
</pre>
          </p>
          <li class="search-li" q-repeat="items" q-show="isShow">
            <a q-attr="href:path|urlformat" class="search-title"><i class="icon-quo-left icon"></i><span q-text="title"></span></a>
            <p class="search-time">
              <i class="icon-calendar icon"></i>
              <span q-text="date|dateformat"></span>
            </p>
            <p class="search-tag">
              <i class="icon-price-tags icon"></i>
              <span q-repeat="tags" q-on="click:choseTag(e, name)" q-text="name|tagformat"></span>
            </p>
          </li>
        </ul>
    	</section>
    

    
    	<section class="tools-section tools-section-friends" q-show="friends">
  		
        <ul class="search-ul">
          
            <li class="search-li">
              <a href="http://localhost:4000/" target="_blank" class="search-title"><i class="icon-quo-left icon"></i>友情链接1</a>
            </li>
          
            <li class="search-li">
              <a href="http://localhost:4000/" target="_blank" class="search-title"><i class="icon-quo-left icon"></i>友情链接2</a>
            </li>
          
            <li class="search-li">
              <a href="http://localhost:4000/" target="_blank" class="search-title"><i class="icon-quo-left icon"></i>友情链接3</a>
            </li>
          
            <li class="search-li">
              <a href="http://localhost:4000/" target="_blank" class="search-title"><i class="icon-quo-left icon"></i>友情链接4</a>
            </li>
          
            <li class="search-li">
              <a href="http://localhost:4000/" target="_blank" class="search-title"><i class="icon-quo-left icon"></i>友情链接5</a>
            </li>
          
            <li class="search-li">
              <a href="http://localhost:4000/" target="_blank" class="search-title"><i class="icon-quo-left icon"></i>友情链接6</a>
            </li>
          
        </ul>
  		
    	</section>
    

    
    	<section class="tools-section tools-section-me" q-show="aboutme">
  	  	
  	  		<div class="aboutme-wrap" id="js-aboutme">很惭愧&lt;br&gt;&lt;br&gt;只做了一点微小的工作&lt;br&gt;谢谢大家</div>
  	  	
    	</section>
    
  </div>
  
</div>
    <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                      <div class="pswp__preloader__cut">
                        <div class="pswp__preloader__donut"></div>
                      </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div> 
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>
  </div>
</body>
</html>